# *__Итоговая проверочная работа__*
### __*Задача:*__

Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

### **_Примеры_**:
- ["hello", "2", "world", ":-)"] -> ["2", ":-)"]
- ["1234", "1567", "-2", "computer science"] -> ["-2"]
- ["Russia", "Denmark", "Kazan"] -> []

## __*Решение:*__
#### 1. Создание блок-схемы
#### 2. Создание кода на C# 
1. Создание начального массива при помощи CreateArray;
2. Заполнение массива случайными словами и цифрами;
3. Написание второго массива, выбирающего из первого только элементы, содержащие 3 и менее символов;
4. Для вывода результата используется Console.WriteLine(ThreeSymbols[i]); 